# Дан массив, состоящий из целых чисел. Напишите
# программу, которая подсчитает количество
# элементов массива, больших предыдущего (элемента
# с предыдущим номером)
# Input: [0, -1, 5, 2, 3]
# Output: 2 (-1 < 5, 2 < 3)

arr_1 = [0, -1, 5, 2, 3]
count = 0
for i in range(1, len(arr_1) - 1):
    if arr_1[i] < arr_1[i + 1]:
        count += 1
print(count)

#==========================

arr_1 = [0, -1, 5, 2, 3]

#print(len([0 for i in range(1, len(arr_1) - 1) if arr_1[i] < arr_1[i + 1]]))

print(sum([1 for i in range(1, len(arr_1) - 1) if arr_1[i] < arr_1[i + 1]]))